Catalogs/ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствующиеВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВредныеОпасныеПроизводственныеФакторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВредныеОпасныеПроизводственныеФакторы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствующиеВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыРаботМедицинскихОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыРаботМедицинскихОсмотров</Name>
			<Comment>АПК:58 различия имени и синонима оправданы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствующиеВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	Поля.Добавить("ВидОсмотра");
	Поля.Добавить("Однократно");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование И Данные.Однократно = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьПредставлениеВредногоФактораВидаРабот(Данные, Представление);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"МедицинскиеОсмотры");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если ЕстьЭлементы() Тогда
		ОбработкаЗавершена = Истина;
		Если Не ЕстьЭлементы(Перечисления.ВидыОбследований.МедицинскийОсмотр) Тогда
			ЗаполнитьВидОсмотраМедицинскогоПеречня(ПараметрыОбновления);
			ОбработкаЗавершена = ПараметрыОбновления.ОбработкаЗавершена;
		КонецЕсли;
		Если Не ЕстьЭлементы(Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование) Тогда
			СоздатьЭлементыПсихиатрическогоПеречня(ПараметрыОбновления);
			ОбработкаЗавершена = ОбработкаЗавершена И ПараметрыОбновления.ОбработкаЗавершена;
		КонецЕсли;
		ПараметрыОбновления.ОбработкаЗавершена = ОбработкаЗавершена;
		Возврат;
	КонецЕсли;
	
	СоздатьЭлементыПоМакету("Перечень29Н", Перечисления.ВидыОбследований.МедицинскийОсмотр);
	СоздатьЭлементыПоМакету("ПереченьПсихиатрический",
		Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	
	ПараметрыОбновления.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Функция ЕстьЭлементы(ВидОсмотра = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
		|ГДЕ
		|	&УсловиеОтбора";
	
	Если ВидОсмотра = Неопределено Тогда
		ТекстЗамены = "ИСТИНА";
	Иначе
		Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
		Если ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
			ТекстЗамены = "ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВидОсмотра = &ВидОсмотра
						  |И ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Однократно";
		Иначе
			ТекстЗамены = "ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВидОсмотра = &ВидОсмотра";
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", ТекстЗамены);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ЗаполнитьВидОсмотраМедицинскогоПеречня(ПараметрыОбновления)
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторы
		|ГДЕ
		|	ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.ПустаяСсылка)";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы);
	
	МедицинскийОсмотр = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Возврат;
		КонецЕсли;
		ВредныйФактор = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
		ВредныйФактор.ВидОсмотра = МедицинскийОсмотр;
		
		// АПК:1327-выкл используется в процедуре обновления.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВредныйФактор);
		// АПК:1327-вкл
		
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАрхивностьЭлементовПсихиатрическогоПеречня(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОсмотра", Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторы
		|ГДЕ
		|	ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра = &ВидОсмотра
		|	И НЕ ВредныеОпасныеПроизводственныеФакторы.ВАрхиве
		|	И НЕ ВредныеОпасныеПроизводственныеФакторы.Однократно
		|	И НЕ ВредныеОпасныеПроизводственныеФакторы.ЭтоГруппа";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы);
	
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Возврат;
		КонецЕсли;
		ВредныйФактор = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
		ВредныйФактор.ВАрхиве = Истина;
		
		// АПК:1327-выкл используется в процедуре обновления.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВредныйФактор);
		// АПК:1327-вкл
		
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеУстаревшихЭлементов()
	
	КодГруппыУстаревшихЭлементов = "OLD";
	
	ГруппаУстаревшихЭлементов = НайтиПоКоду(КодГруппыУстаревшихЭлементов);
	Если Не ЗначениеЗаполнено(ГруппаУстаревшихЭлементов) Тогда
		ГруппаУстаревшихЭлементовОбъект = СоздатьГруппу();
		ГруппаУстаревшихЭлементовОбъект.Код = КодГруппыУстаревшихЭлементов;
		ГруппаУстаревшихЭлементовОбъект.Наименование = НСтр("ru = 'Устаревшие элементы'");
		ГруппаУстаревшихЭлементовОбъект.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
		ГруппаУстаревшихЭлементовОбъект.ВАрхиве = Истина;
		
		ГруппаУстаревшихЭлементовОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаУстаревшихЭлементовОбъект.Записать();
		ГруппаУстаревшихЭлементов = ГруппаУстаревшихЭлементовОбъект.Ссылка;
	ИначеЕсли Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаУстаревшихЭлементов, "ВАрхиве") Тогда
		ГруппаУстаревшихЭлементовОбъект = ГруппаУстаревшихЭлементов.ПолучитьОбъект();
		ГруппаУстаревшихЭлементовОбъект.ВАрхиве = Истина;
		
		ГруппаУстаревшихЭлементовОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаУстаревшихЭлементовОбъект.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОсмотра", Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	Запрос.УстановитьПараметр("КодГруппыУстаревшихЭлементов", КодГруппыУстаревшихЭлементов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторы
		|ГДЕ
		|	ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра = &ВидОсмотра
		|	И ВЫБОР
		|		КОГДА ВредныеОпасныеПроизводственныеФакторы.ЭтоГруппа
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ
		|		НЕ ВредныеОпасныеПроизводственныеФакторы.Однократно
		|	КОНЕЦ
		|	И
		|		ВредныеОпасныеПроизводственныеФакторы.Родитель = ЗНАЧЕНИЕ(Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ПустаяСсылка)
		|	И НЕ ВредныеОпасныеПроизводственныеФакторы.Код = &КодГруппыУстаревшихЭлементов";
	
	// АПК:1328-выкл используется при начальном заполнении ИБ.
	РезультатЗапроса = Запрос.Выполнить();
	// АПК:1328-вкл
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Родитель = ГруппаУстаревшихЭлементов;
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		// АПК:1327-выкл используется при начальном заполнении ИБ.
		СправочникОбъект.Записать();
		// АПК:1327-вкл
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыПсихиатрическогоПеречня(ПараметрыОбновления = Неопределено) Экспорт
	
	ПсихиатрическоеОсвидетельствование = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Если ЕстьЭлементы(ПсихиатрическоеОсвидетельствование) Тогда
		ПроверитьНаличиеУстаревшихЭлементов();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	СоздатьЭлементыПоМакету("ПереченьПсихиатрический", ПсихиатрическоеОсвидетельствование);
	
КонецПроцедуры

Процедура СоздатьЭлементыПоМакету(ИмяМакета, ВидОсмотра)
	
	ТаблицаИзМакета = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ПолучитьМакет(ИмяМакета).ПолучитьТекст()).Данные;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СоздатьЭлементыПоТаблицеМакета(ТаблицаИзМакета, ВидОсмотра);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения классификатора вредных (опасных) производственных факторов'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура СоздатьЭлементыПоТаблицеМакета(ТаблицаМакета, ВидОсмотра)
	
	Для Каждого СтрокаТаблицы Из ТаблицаМакета Цикл
		Если СтрокаТаблицы["IsGroup"] = "True" Тогда
			ДобавитьГруппу(СтрокаТаблицы, ВидОсмотра);
		Иначе
			ДобавитьЭлемент(СтрокаТаблицы, ВидОсмотра);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлемент(СтрокаТаблицы, ВидОсмотра)
	
	СправочникОбъект = СоздатьЭлемент();
	СправочникОбъект.Код = СтрокаТаблицы["Code"];
	СправочникОбъект.Наименование = СтрокаТаблицы["Name"];
	СправочникОбъект.Описание = СтрокаТаблицы["Description"];
	СправочникОбъект.ВидОсмотра = ВидОсмотра;
	Если ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
		СправочникОбъект.ПредставлениеПериодичностиОсмотра = НСтр("ru = 'Однократно'");
		СправочникОбъект.Однократно = Истина;
	Иначе
		СправочникОбъект.Родитель = РодительПоКоду(СтрокаТаблицы["GroupCode"]);
		Если Не ПустаяСтрока(СтрокаТаблицы["FrequencyPeriod"]) Тогда
			СправочникОбъект.КратностьОсмотра = Число(СтрокаТаблицы["FrequencyMultiplicity"]);
			СправочникОбъект.ПериодичностьОсмотра = Число(СтрокаТаблицы["FrequencyRate"]);
			СправочникОбъект.ЕдиницаПериодичностиОсмотра = Перечисления.Периодичность[СтрокаТаблицы["FrequencyPeriod"]];
		КонецЕсли;
		СправочникОбъект.ЗаполнитьПредставлениеПериодичности();
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
КонецПроцедуры

Процедура ДобавитьГруппу(СтрокаТаблицы, ВидОсмотра)
	
	СправочникОбъект = СоздатьГруппу();
	СправочникОбъект.Код = СтрокаТаблицы["Code"];
	СправочникОбъект.Наименование = СтрокаТаблицы["Name"];
	СправочникОбъект.Родитель = РодительПоКоду(СтрокаТаблицы["GroupCode"]);
	СправочникОбъект.ВидОсмотра = ВидОсмотра;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
КонецПроцедуры

Функция РодительПоКоду(КодГруппы)
	
	Если ПустаяСтрока(КодГруппы) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ГруппаСсылка = НайтиПоКоду(КодГруппы);
	Если ГруппаСсылка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ГруппаСсылка;
	
КонецФункции

Процедура ЗаполнениеСоответствий(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	ПсихиатрическоеОсвидетельствование = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Если ЕстьСоответствия() Тогда
		Если ЕстьЭлементы(ПсихиатрическоеОсвидетельствование) И Не ЕстьСоответствия(ПсихиатрическоеОсвидетельствование) Тогда
		    СоздатьСоответствияПоМакету(Истина);
		КонецЕсли;
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	СоздатьСоответствияПоМакету();
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Функция ЕстьСоответствия(ВидОсмотра = Неопределено) Экспорт
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы.СоответствующиеВредныеФакторы КАК СоответствующиеВредныеФакторы
		|ГДЕ
		|	&УсловиеОтбора
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров.СоответствующиеВредныеФакторы КАК СоответствующиеВредныеФакторы
		|ГДЕ
		|	&УсловиеОтбора";
	
	// АПК:96 -вкл
	
	Если ВидОсмотра = Неопределено Тогда
		ТекстЗамены = "ИСТИНА";
	Иначе
		Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
		ТекстЗамены = "СоответствующиеВредныеФакторы.Ссылка.ВидОсмотра = &ВидОсмотра";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", ТекстЗамены);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьСоответствияПоМакету(ИсключитьПеречень29Н = Ложь)
	
	ТаблицаИзМакета = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ПолучитьМакет("СоответствиеПеречня302НПеречню29Н").ПолучитьТекст()).Данные;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.ВидыРаботМедицинскихОсмотров");
	Блокировка.Добавить("Справочник.ВредныеОпасныеПроизводственныеФакторы");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СоздатьСоответствияПоТаблицеМакета(ТаблицаИзМакета, ИсключитьПеречень29Н);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения соответствия вредных факторов по приказу 302н вредным факторам по приказу 29н'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура СоздатьСоответствияПоТаблицеМакета(ТаблицаМакета, ИсключитьПеречень29Н)
	
	ВредныеФакторы302н = ВредныеФакторы302н();
	ВредныеФакторы29н = ВредныеФакторы29н();
	
	Для Каждого СтрокаТаблицы Из ТаблицаМакета Цикл
		ЭтоСтрокаПеречня29Н = СтрокаТаблицы["IsPsycho"] = "False";
		Если ИсключитьПеречень29Н И ЭтоСтрокаПеречня29Н Тогда
			Продолжить;	
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы["Code29n"]) Тогда
			ДобавитьСоответствияФакторов(СтрокаТаблицы, ВредныеФакторы302н, ВредныеФакторы29н, ЭтоСтрокаПеречня29Н);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСоответствияФакторов(СтрокаТаблицы, ВредныеФакторы302н, ВредныеФакторы29н, ЭтоСтрокаПеречня29Н)
	
	Фактор302н = НайденныйВредныйФактор(ЭтоСтрокаПеречня29Н, СтрокаТаблицы["Code"], ВредныеФакторы302н);
	
	Если Не ЗначениеЗаполнено(Фактор302н) Тогда
		Возврат;
	КонецЕсли;
	
	Фактор302нОбъект = Фактор302н.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(Фактор302нОбъект.Ссылка);
	
	Если ЭтоСтрокаПеречня29Н Тогда
		Для Каждого КодФактора Из КодыФакторовПоПриказу29Н(СтрокаТаблицы["Code29n"]) Цикл
			Фактор29н = НайденныйВредныйФактор(ЭтоСтрокаПеречня29Н, КодФактора, ВредныеФакторы29н);
			УстановитьНовоеСоответствие(Фактор302нОбъект, Фактор29н);
		КонецЦикла;
	Иначе
		Фактор29н = НайденныйВредныйФактор(ЭтоСтрокаПеречня29Н, СтрокаТаблицы["Code29n"], ВредныеФакторы29н, 150);
		УстановитьНовоеСоответствие(Фактор302нОбъект, Фактор29н);
	КонецЕсли;
	
	УстановленоСоответствий = Фактор302нОбъект.СоответствующиеВредныеФакторы.Количество();
	
	Если УстановленоСоответствий = 0 Тогда
		Возврат;
	ИначеЕсли УстановленоСоответствий = 1 Тогда
		Фактор302нОбъект.СоответствиеПодтверждено = Истина;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Фактор302нОбъект);
	
КонецПроцедуры

Процедура УстановитьНовоеСоответствие(Фактор302нОбъект, Фактор29н)
	
	Если Не ЗначениеЗаполнено(Фактор29н) Тогда
		Возврат;
	КонецЕсли;
	
	Фактор302нОбъект.СоответствующиеВредныеФакторы.Добавить().ВредныйФактор = Фактор29н;
	
КонецПроцедуры

Функция КодыФакторовПоПриказу29Н(СтрокаКодов)
	Возврат СтрРазделить(СтрокаКодов, ",");
КонецФункции

Функция ВредныеФакторы302н()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыРаботМедицинскихОсмотров.Ссылка,
		|	ВидыРаботМедицинскихОсмотров.Наименование,
		|	ВидыРаботМедицинскихОсмотров.Код,
		|	ВидыРаботМедицинскихОсмотров.ВидОсмотра
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотров
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторы.Ссылка,
		|	ВредныеОпасныеПроизводственныеФакторы.Наименование,
		|	ВредныеОпасныеПроизводственныеФакторы.Код,
		|	ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеОпасныеПроизводственныеФакторы
		|ГДЕ
		|	НЕ ВредныеОпасныеПроизводственныеФакторы.ЭтоГруппа";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВредныеФакторы29н()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторы.Ссылка,
		|	ВредныеОпасныеПроизводственныеФакторы.Наименование,
		|	ВредныеОпасныеПроизводственныеФакторы.Код,
		|	ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторы
		|ГДЕ
		|	НЕ ВредныеОпасныеПроизводственныеФакторы.ЭтоГруппа";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НайденныйВредныйФактор(ЭтоСтрокаПеречня29Н, ЗначениеПоиска, ВредныеФакторы, ДлинаНаименования = 100)
	
	Описание = ОписаниеФактора();
	
	Если ЭтоСтрокаПеречня29Н Тогда
		Описание.Удалить("Наименование");
		Описание.Код = ЗначениеПоиска;
		Описание.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	Иначе
		Описание.Удалить("Код");
		Описание.Наименование = Лев(ЗначениеПоиска, ДлинаНаименования);
		Описание.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	КонецЕсли;
	
	НайденныеСтроки = ВредныеФакторы.НайтиСтроки(Описание);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОписаниеФактора()
	
	Возврат Новый Структура("Код,Наименование,ВидОсмотра");
	
КонецФункции

Функция ВыполнитьЗаписьОбъекта(ДанныеОбъекта) Экспорт
	
	СправочникОбъект = ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(СправочникОбъект.Ссылка.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", СправочникОбъект.Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СправочникОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка записи классификатора вредных (опасных) производственных факторов и видов работ'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	
КонецФункции

#КонецОбласти

#КонецЕсли
